{
  "id": "api-modes--local,-service,-and-cloud",
  "type": "api",
  "title": "Modes -Local, Service, and Cloud",
  "path": "/Users/aojdevstudio/cursor-projects/open-dental-scrape/docs/api-documentation/API Modes -Local, Service, and Cloud.txt",
  "content": "API Modes - Local, Service, and Cloud\nSee API Specification\n\nRemote API Alternatives\n\nDevelopers may elect to use either the Local API or API Service modes in addition to our Remote API endpoint (https://api.opendental.com/api/v1/). Both the Local and Service API modes operate on the customer's network, which greatly decreases execution time.\n\nA single remote web call is made automatically to validate credentials. Subsequent API requests can be made without an internet connection. This web call is made once per instance of the Local API and API Service and is valid for six hours until another web call will need to be made.\n\n\nLocal API\nVersion Added: 22.1\n\nThe Local API is an instance of our API that runs on a single workstation. Open Dental automatically launches the Local API on startup after the user has successfully logged in. No other action is required from the user. A specific port (30222) is opened and API requests can be sent locally on that workstation.\n\nEndpoints:\n\nhttp://localhost:30222/api/v1/\nhttp://127.0.0.1:30222/api/v1/\nOpen Dental will close this port automatically when the software closes. If more than one instance of Open Dental is opened on the workstation, only the first instance will open a port and listen for API requests. Subsequent concurrent instances will not run the Local API. No firewall setting should need to be changed.\n\nHow to Use:\n\n1. Start Open Dental on a workstation.\n2. Choose a database. The Local API is started automatically.\n3. Software on that workstation can make calls to http://localhost:30222/api/v1/ .\n4. Close Open Dental to stop the Local API.\n\n\nAPI Service\nVersion Added: 22.2\n\nSee API Guide - The API Service.\n\nThe API Service is an instance of our API that continuously runs on a machine. A specific port (30223) is opened and API requests can be sent locally or from in-network workstations. Customers will run this service on the server that is also running their eConnector service. Installation occurs automatically from the OpenDentalAPIService.exe that is now included when updating Open Dental. When started, the API Service will connect to the database specified in the OpenDentalWebConfig.xml file created at installation. Log files are also created. These files are located in the \\\\OpenDental\\OpenDentalAPIService directory.\n\nEndpoints:\n\nhttp://localhost:30223/api/v1/\nhttp://127.0.0.1:30223/api/v1/\nhttp://{Private IP Address}:30223/api/v1/\nAn Inbound Rule for port 30223 must be created on the server to allow API requests from other workstations.\n\nHow to Use:\n\n1a. Update the dental office Server that runs the eConnector to version 22.2.16 or later. Open Dental should be run as Admin.\n1b. (One time only) Create an Inbound Rule in Windows Firewall for Port 30223.\n2. The API Service is automatically installed and started on this machine (no other workstations).\n3a. Software on the server or any network workstation can make calls to http://{IP Address of Server}:30223/api/v1/ .\n3b. If a subscription has been set up, Database Events will also fire from this machine.\n4. The API Service will automatically start after restarting the server.\n5. Stop the API Service either in Open Dental's Service Manager (Tools > Misc Tools > Service Manager) or with the Windows Service Manager.\n\n\nManual Installation:\nThe API Service is automatically installed and started for dental offices that have the API enabled. However, to manually install the service follow the steps below.\n\nFor versions 22.2.42 and later:\n\n1. Launch Open Dental as Administrator.\n2. Ensure the API Enabled box is checked in Setup > Advanced Setup > API.\n3. Navigate to Tools > Misc Tools > Service Manager. Click Add.\n4. Name the service OpenDentalAPIService and Browse to select the OpenDentalAPIService.exe.\n5. Click Install, enter your database connection details in the form, click OK, then Start.\n\nFor versions 22.2.41 and earlier:\n\n1a. Navigate to \\\\OpenDental\\OpenDentalAPIService and ensure there is an OpenDentalWebConfig.xml\n1b. If absent, copy the OpenDentalWebConfig.xml from \\\\OpenDental\\OpenDentalEconnector\n1c. Move the copy to the OpenDentalAPIService folder. Paste the following line between the </DatabaseType> and </DatabaseConnection> nodes: <Note>DentalOffice</Note>\n2. Launch Open Dental as Administrator.\n3. Ensure the API Enabled box is checked in Setup > Advanced Setup > API.\n4. Navigate to Tools > Misc Tools > Service Manager. Click Add.\n5. Name the service OpenDentalAPIService and Browse to select the OpenDentalAPIService.exe.\n6. Click Install and then Start.\n\nThe API Service can be uninstalled by clicking the Uninstall button within this same window.\n\n\nAPI for Open Dental Cloud\nVersion Added: 22.3\n\nUsers of Open Dental Cloud are able to use the API Service. The virtual machine hosting Open Dental has both the eConnector and the API Service installed for the dental office. The Open Dental Cloud Client passes API requests from the user's workstation to and from the virtual machine. The endpoint is the same as the cloudless API Service. Therefore a third party software does not even need to distinguish between the customer utilizing Cloud or not.\n\nHow to Use:\n\n1. Software on the workstation can make calls to http://{IP Address of Workstation}:30223/api/v1/\n2. API requests can be made as long as the Cloud Client is running\n",
  "metadata": {
    "version": "22.3",
    "lastUpdated": "",
    "category": [
      "API"
    ],
    "tags": [
      "Modes -Local, Service, and Cloud"
    ]
  },
  "endpoints": [],
  "relationships": [
    {
      "type": "references",
      "target": "db-document",
      "description": "API references database table document"
    }
  ]
}